<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Hash;

class Admin extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('users')->insert([
            'name'=> 'root',
            'email'=>'admin@gmail.com',
            'password'=>Hash::make('root1234')
        ]);
        DB::table('roles')->insert([
            'name'=> 'admin',
            'guard_name'=>'web',
        ]);
        DB::table('model_has_roles')->insert([
            'model_type'=> 'App\Models\User',
            'role_id'=>'1',
            'model_id'=>'1',
        ]);
        DB::table('product_ukrs')->insert([
            'name' => "Лимона кислота",
            'group' => "Антиоксиданты",
            'field_of_usage' => "пиво-безалкогольная, кондитерская, хлебо-булочная, консервная",
            'Package' => "мішки 25 кг",
            'Storage' => "зберігати в сухому захищеному від світла місці",
            'Standart' => "Відповідає стандартам якості: ВР2009, USP32, FCC6, E330.",
            'description' => "В харчовій промисловості лимона кислота (Е330) широко використовується в виробництві без-алкогольних напоїв, тому що має найбільш мякий та освіжаючий смак в порівнянні з іншими харчовими кислотами.

При виробництві кондитерських виробів використовується як ароматизатор та підкислювач. При виробництві хлібо-булочних виробів використовується як один з компонентів  розпушувача тіста. В олія-жировій промисловості лимона кислота значно зменшує вірогідність прогоркання жирыв, маргаринів та животного масла. При виробництві консервів, використовується як консервант.

В косметичних препаратах використовується як консервант, розчинник, модіфікатор pH, відповідного pH кожи. Надає в'яжучий, очищающий та відбілюючий ефект шкірі. Вводиться в склад кремів, депіляторіїв, ополаскувачів для волос, кремів. Лимона кислота використовується як підкислювач в кормах. Володіє потужним антибактеріальною дією, має антістресову дію, є каталізатором обміну речовин, сінергістом антиоксидантів. Відповідає за активізацію ферментів, поліпшує засвоюванність  кормів.
",
        ]);
        DB::table('product_rus')->insert([
            'name' => "Лимонная кислота",
            'group' => "Антиоксиданты",
            'field_of_usage' => " пиво-безалкогольная, кондитерская, хлебо-булочная, консервная",
            'Package' => "мешки 25 кг",
            'Storage' => "Соответствует стандартам качества: ВР2009, USP32, FCC6, E330.",
            'Standart' => "Відповідає стандартам якості: ВР2009, USP32, FCC6, E330.",
            'description' => "В пищевой промышленности лимонная кислота (Е330)  широко применяется  в производстве безалкогольных напитков, поскольку обладает наиболее мягким и освежающим вкусом по сравнению с другими пищевыми кислотами.

В производстве кондитерских изделий применяется как ароматизатор и подкислитель. В производстве хлебобулочных изделий применяется как один из компонентов разрыхлителей теста. В масложировой промышленности лимонная кислота значительно снижает вероятность прогоркания жиров, маргаринов и животного масла. При производстве консервов используется, как консервант.
В косметических препаратах  применяется как консервант, разбавитель, модификатор pH, соответствующего pH кожи. Оказывает на кожу вяжущее, очищающее и отбеливающее действие. Вводится в состав очищающих кремов, депиляториев, ополаскивателей для волос, красок для волос, кремов от веснушек.
Лимонная кислота используется как подкислитель в кормах.  Обладает сильным антибактериальным действием, оказывает антистрессовое действие, является катализатором обмена веществ, синергистом антиоксидантов. Отвечает за активизацию ферментов, улучшает усвояемость кормов.
",
        ]);
    }
}
